tutorials/sonicFoam/shockTube/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U     (0 0 0)
    volScalarFieldValue T     348.43206
    volScalarFieldValue p     1.0e+5
);

regions
(
    boxToCell
    {
        box    (0 -1 -1) (5 1 1);

        fieldValues
        (
            volScalarFieldValue T     278.74564
            volScalarFieldValue p     1.0e+4
        );
    }
);

// ************************************************************************* //
